
Pusher: @MarkWarneke, Action: `pull_request`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>


```terraform
Acquiring state lock. This may take a few moments...
module.network.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet]
module.load-more.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more]
module.shared.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared]
module.aml.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml]
module.network.random_id.randomId: Refreshing state... [id=Qg7W0bnvEqvOZg]
module.load-more.random_id.randomId: Refreshing state... [id=krUZRQhKcaZVxg]
module.shared.random_id.randomId: Refreshing state... [id=64mJpksEEewRxA]
module.aml.random_id.randomId: Refreshing state... [id=qYIc6p6w5IyeVQ]
module.network.azurerm_network_security_group.allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/networkSecurityGroups/markwarnekeme-allow-nsg]
module.load-more.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/microsoft.insights/components/load-more]
module.network.azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet]
module.load-more.module.cosmosdb_account.azurerm_cosmosdb_account.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.DocumentDB/databaseAccounts/load-more]
module.shared.module.container_registry.azurerm_container_registry.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme]
module.aml.module.machine_learning_workspace.azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.Storage/storageAccounts/markwarnekemeamla9821ce]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.OperationalInsights/workspaces/markwarnekeme]
module.shared.module.event_hub.azurerm_eventhub_namespace.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme]
module.aml.module.machine_learning_workspace.module.application_insights.azurerm_application_insights.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55]
module.shared.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared]
module.load-more.module.key_vault.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more]
module.network.azurerm_subnet.backend_virtual_node: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend-aci]
module.network.azurerm_subnet.backend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-backend]
module.network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.aml.module.machine_learning_workspace.module.key_vault.null_resource.wait_policy: Refreshing state... [id=1750616678356796960]
module.network.azurerm_subnet_network_security_group_association.frontend-allow80: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-vnet/providers/Microsoft.Network/virtualNetworks/markwarnekeme-vnet/subnets/markwarnekeme-frontend]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.maleware: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AntiMalware(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.security: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Security(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.nsg: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureNSGAnalytics(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.updates: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/Updates(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.infrastructure: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/InfrastructureInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.keyvault: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/KeyVaultAnalytics(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.container: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(markwarnekeme)]
module.shared.module.log_analytics_workspace.azurerm_log_analytics_solution.activity: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/markwarnekeme-shared/providers/Microsoft.OperationsManagement/solutions/AzureActivity(markwarnekeme)]
module.shared.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared|markwarnekemeshared]
module.shared.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.KeyVault/vaults/markwarnekemeshared/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.load-more.module.key_vault.azurerm_key_vault_access_policy.sp_terraform: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more/objectId/dde8affe-86ad-46e2-b728-691e676b4eb3]
module.shared.module.event_hub.azurerm_monitor_diagnostic_setting.eventhub_namespace_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme|markwarnekeme]
module.shared.module.event_hub.azurerm_eventhub.main: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.EventHub/namespaces/markwarnekeme/eventhubs/markwarnekeme]
module.load-more.module.kubernetes_cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more]
module.load-more.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/load-more/providers/Microsoft.KeyVault/vaults/load-more|load-more]
module.shared.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme|markwarnekeme]
module.shared.module.key_vault.null_resource.wait_policy: Refreshing state... [id=8045184661042629246]
module.load-more.module.key_vault.null_resource.wait_policy: Refreshing state... [id=9121554231835175228]
module.load-more.module.kubernetes_cluster.azurerm_monitor_diagnostic_setting.diagnostics: Refreshing state... [id=/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourcegroups/load-more/providers/Microsoft.ContainerService/managedClusters/load-more|load-more]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aml.module.machine_learning_workspace.azurerm_machine_learning_workspace.main will be created
  + resource "azurerm_machine_learning_workspace" "main" {
      + application_insights_id = (known after apply)
      + container_registry_id   = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.ContainerRegistry/registries/markwarnekeme"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + location                = "westeurope"
      + name                    = "markwarnekemeaml"
      + resource_group_name     = "markwarnekeme-aml"
      + sku_name                = "Basic"
      + storage_account_id      = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/Microsoft.Storage/storageAccounts/markwarnekemeamla9821ce"
      + tags                    = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.aml.module.machine_learning_workspace.module.application_insights.azurerm_application_insights.main must be replaced
-/+ resource "azurerm_application_insights" "main" {
      ~ app_id                                = "8477d4d9-4e32-4571-aa92-50c152be76d6" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-aml/providers/microsoft.insights/components/markwarnekemeamla9821cea9eb0e48c9e55" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
      ~ name                                  = "markwarnekemeamla9821cea9eb0e48c9e55" -> "markwarnekemeamla9821ce" # forces replacement
        tags                                  = {
            "id"        = "a9821cea9eb0e48c9e55"
            "terraform" = "true"
        }
        # (7 unchanged attributes hidden)
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westeurope"
      + name                        = "markwarnekemeamla9821ce"
      + resource_group_name         = "markwarnekeme-aml"
      + sku_name                    = "premium"
      + soft_delete_enabled         = true
      + tags                        = {
          + "id"        = "a9821cea9eb0e48c9e55"
          + "terraform" = "true"
        }
      + tenant_id                   = "72f988bf-86f1-41af-91ab-2d7cd011db47"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_key_vault_access_policy.sp_terraform will be created
  + resource "azurerm_key_vault_access_policy" "sp_terraform" {
      + certificate_permissions = [
          + "create",
          + "delete",
          + "deleteissuers",
          + "get",
          + "getissuers",
          + "import",
          + "list",
          + "listissuers",
          + "managecontacts",
          + "manageissuers",
          + "setissuers",
          + "update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "backup",
          + "create",
          + "decrypt",
          + "delete",
          + "encrypt",
          + "get",
          + "import",
          + "list",
          + "purge",
          + "recover",
          + "restore",
          + "sign",
          + "unwrapKey",
          + "update",
          + "verify",
          + "wrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "dde8affe-86ad-46e2-b728-691e676b4eb3"
      + secret_permissions      = [
          + "backup",
          + "delete",
          + "get",
          + "list",
          + "purge",
          + "recover",
          + "restore",
          + "set",
        ]
      + tenant_id               = "72f988bf-86f1-41af-91ab-2d7cd011db47"
    }

  # module.aml.module.machine_learning_workspace.module.key_vault.azurerm_monitor_diagnostic_setting.kv_diag_settings will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv_diag_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/a287d458-0ab8-4a73-9ca6-6f44345f1ada/resourceGroups/markwarnekeme-shared/providers/Microsoft.OperationalInsights/workspaces/markwarnekeme"
      + name                       = "markwarnekemeamla9821ce"
      + target_resource_id         = (known after apply)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.
Releasing state lock. This may take a few moments...

```


</details>
